app/Http/Controllers/DiklatBidangKerjaController.php

select * from `diklat_jenis` where `status_aktif` = 'Y' and `diklat_jenis`.`deleted_at` is null
select * from `diklat_bidang_pelatihans` where `status_aktif` = 'Y' and `diklat_bidang_pelatihans`.`deleted_at` is null
---
    public function create()
    {
        $diklatJenis  = DiklatJenis::where('status_aktif', 'Y')->get();
        $diklatBidang = DiklatBidangPelatihan::where('status_aktif', 'Y')->get();