app/Http/Controllers/DiklatBidangPelatihanController.php

    public function create()
    {
        $diklatJenis = DiklatJenis::where('status_aktif', 'Y')->get();
---
select * from `diklat_jenis` where `status_aktif` = 'Y' and `diklat_jenis`.`deleted_at` is null

    public function edit($id)
    {
        $diklatJenis = DiklatJenis::where('status_aktif', 'Y')->get();
---
select * from `diklat_jenis` where `status_aktif` = 'Y' and `diklat_jenis`.`deleted_at` is null