app/Http/Controllers/DiklatController.php

select * from `diklat_jenis` where `status_aktif` = 'Y' and `diklat_jenis`.`deleted_at` is null
select * from `diklat_bidang_pelatihans` where `status_aktif` = 'Y' and `diklat_bidang_pelatihans`.`deleted_at` is null
select * from `diklat_jenis_kegiatans` where `diklat_jenis_kegiatans`.`deleted_at` is null
select * from `diklat_model_pelatihans` where `diklat_model_pelatihans`.`deleted_at` is null
---
    public function create()
    {
        $jenisDiklat     = DiklatJenis::where('status_aktif', 'Y')->get();
        $bidangPelatihan = DiklatBidangPelatihan::where('status_aktif', 'Y')->get();
        $jenisKegiatan   = DiklatJenisKegiatan::all();
        $modelPelatihan  = DiklatModelPelatihan::all();